In [1]:
import numpy as np
import pandas as pd

# Series
you can convert list, numpy, or dictionary to a Series

In [2]:
#create Series
ser1=pd.Series([1,2,3],index=['A','B','C'])

In [7]:
#Show first three rows
ser1.head(10)

A    1
B    2
C    3
dtype: int64

In [9]:
ser1['B']

2

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [13]:
data=np.random.randn(5,4)
data

array([[-0.92869299, -0.3417924 ,  0.12645417, -0.7366953 ],
       [ 0.10557258, -0.21910927, -1.63951844, -0.97346061],
       [ 0.78377677,  1.57940876, -1.51163965, -1.16248324],
       [-0.49523216, -0.68556302, -2.29004631,  1.38259453],
       [ 0.02122359,  1.08254178, -1.0097739 , -0.95956308]])

In [14]:
index=['A', 'B', 'C', 'D', 'E']
index

['A', 'B', 'C', 'D', 'E']

In [16]:
col=['W', 'X', 'Y', 'Z']
col

['W', 'X', 'Y', 'Z']

In [21]:
#create DataFrame
df=pd.DataFrame(data,index=index,columns=col)
df

          W         X         Y         Z
A -0.928693 -0.341792  0.126454 -0.736695
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

# Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [22]:
df['W']

A   -0.928693
B    0.105573
C    0.783777
D   -0.495232
E    0.021224
Name: W, dtype: float64

In [24]:
# Pass a list of column names
df[['W','Z','Y']]

          W         Z         Y
A -0.928693 -0.736695  0.126454
B  0.105573 -0.973461 -1.639518
C  0.783777 -1.162483 -1.511640
D -0.495232  1.382595 -2.290046
E  0.021224 -0.959563 -1.009774

### Creating a new column:

In [32]:
df['new']=df['W']+df['X']
df

          W         X         Y         Z       new
A -0.928693 -0.341792  0.126454 -0.736695 -1.270485
B  0.105573 -0.219109 -1.639518 -0.973461 -0.113537
C  0.783777  1.579409 -1.511640 -1.162483  2.363186
D -0.495232 -0.685563 -2.290046  1.382595 -1.180795
E  0.021224  1.082542 -1.009774 -0.959563  1.103765

### Removing Columns

In [33]:
df.drop(['new'],axis=1,inplace=True)

In [34]:
# Not inplace unless specified!
df

          W         X         Y         Z
A -0.928693 -0.341792  0.126454 -0.736695
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

In [35]:
df

          W         X         Y         Z
A -0.928693 -0.341792  0.126454 -0.736695
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

In [36]:
df

          W         X         Y         Z
A -0.928693 -0.341792  0.126454 -0.736695
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

Can also drop rows this way:

In [37]:
df.drop('A',axis=0)

          W         X         Y         Z
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

In [38]:
df

          W         X         Y         Z
A -0.928693 -0.341792  0.126454 -0.736695
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

### Selecting Rows

In [39]:
#Row of A
df.loc['A']

W   -0.928693
X   -0.341792
Y    0.126454
Z   -0.736695
Name: A, dtype: float64

##### Or select based off of position instead of label

In [41]:
#Row of index two (الصف الثالث)
df.iloc[2]

W    0.783777
X    1.579409
Y   -1.511640
Z   -1.162483
Name: C, dtype: float64

### Selecting subset of rows and columns

In [42]:
df.iloc[0,:]

W   -0.928693
X   -0.341792
Y    0.126454
Z   -0.736695
Name: A, dtype: float64

In [47]:
df.iloc[:,1]

A   -0.341792
B   -0.219109
C    1.579409
D   -0.685563
E    1.082542
Name: X, dtype: float64

# Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [48]:
df

          W         X         Y         Z
A -0.928693 -0.341792  0.126454 -0.736695
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
D -0.495232 -0.685563 -2.290046  1.382595
E  0.021224  1.082542 -1.009774 -0.959563

In [49]:
df>0

       W      X      Y      Z
A  False  False   True  False
B   True  False  False  False
C   True   True  False  False
D  False  False  False   True
E   True   True  False  False

In [50]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.126454       NaN
B  0.105573       NaN       NaN       NaN
C  0.783777  1.579409       NaN       NaN
D       NaN       NaN       NaN  1.382595
E  0.021224  1.082542       NaN       NaN

In [51]:
df[df['W']>0 ]

          W         X         Y         Z
B  0.105573 -0.219109 -1.639518 -0.973461
C  0.783777  1.579409 -1.511640 -1.162483
E  0.021224  1.082542 -1.009774 -0.959563

In [52]:
df[df['W']>0]['X']

B   -0.219109
C    1.579409
E    1.082542
Name: X, dtype: float64

### For two conditions you can use | and & with parenthesis:

In [59]:
df[ (df['W']>0) | (df.X < 0)  ]['W']

A   -0.928693
B    0.105573
C    0.783777
D   -0.495232
E    0.021224
Name: W, dtype: float64

# More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [61]:
index=['CA', 'NY', 'WY', 'OR', 'CO']
index

['CA', 'NY', 'WY', 'OR', 'CO']

In [63]:
df['States']=index
df

          W         X         Y         Z States
A -0.928693 -0.341792  0.126454 -0.736695     CA
B  0.105573 -0.219109 -1.639518 -0.973461     NY
C  0.783777  1.579409 -1.511640 -1.162483     WY
D -0.495232 -0.685563 -2.290046  1.382595     OR
E  0.021224  1.082542 -1.009774 -0.959563     CO

In [64]:
#Set index
df.set_index(['States'])

               W         X         Y         Z
States
CA     -0.928693 -0.341792  0.126454 -0.736695
NY      0.105573 -0.219109 -1.639518 -0.973461
WY      0.783777  1.579409 -1.511640 -1.162483
OR     -0.495232 -0.685563 -2.290046  1.382595
CO      0.021224  1.082542 -1.009774 -0.959563

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [65]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [66]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [67]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [71]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [69]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     A    B  C
0  1.0  5.0  1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

   C
0  1
1  2
2  3

In [75]:
df.fillna(value='FIL')

     A    B  C
0  1.0  5.0  1
1  2.0  FIL  2
2  FIL  FIL  3

In [77]:
df['A'].mean()

1.5

In [80]:
df.fillna(value=df['A'].max())

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

# duplicated 

Let's show a few convenient methods to deal with duplicated Data in pandas:

In [81]:
df = pd.DataFrame({'A':[1,1,15,1],
                  'B':[2,2,11,2],
                  'C':[3,3,7,2],
                  'C':[3,3,7,3]})

df

    A   B  C
0   1   2  3
1   1   2  3
2  15  11  7
3   1   2  3

In [82]:
df.duplicated()

0    False
1     True
2    False
3     True
dtype: bool

In [83]:
df.duplicated().sum()

2

In [86]:
df.drop_duplicates(inplace=True)

In [87]:
df

    A   B  C
0   1   2  3
2  15  11  7

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [88]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [89]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [90]:
df.col2.nunique()

3

In [91]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [92]:
df['col2'].value_counts().sort_values()

col2
555    1
666    1
444    2
Name: count, dtype: int64

# Applying Functions

In [93]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [99]:
def main(x):
    return x*10

In [100]:
df['col1'].apply(main)

0    10
1    20
2    30
3    40
Name: col1, dtype: int64

### Get column and index names:

In [101]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [102]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [104]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

# Read and Save data

This notebook is the reference code for getting Read and Save, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [115]:
df=pd.read_csv('new/data.csv')
df.head()

   rank         state state_code  2020_census  percent_of_total
0     1    California         CA   39538223.0            0.1191
1     2         Texas         TX   29145505.0            0.0874
2     3       Florida         FL   21538187.0            0.0647
3     4           NaN         NY          NaN            0.0586
4     5  Pennsylvania         PA   13002700.0            0.0386

In [111]:
df.head()

   rank         state state_code  2020_census  percent_of_total
0     1    California         CA   39538223.0            0.1191
1     2         Texas         TX   29145505.0            0.0874
2     3       Florida         FL   21538187.0            0.0647
3     4           NaN         NY          NaN            0.0586
4     5  Pennsylvania         PA   13002700.0            0.0386

In [117]:
df=pd.read_csv('new/data.csv',index_col=['rank'])
df.head()

             state state_code  2020_census  percent_of_total
rank
1       California         CA   39538223.0            0.1191
2            Texas         TX   29145505.0            0.0874
3          Florida         FL   21538187.0            0.0647
4              NaN         NY          NaN            0.0586
5     Pennsylvania         PA   13002700.0            0.0386

In [118]:
df.head()

             state state_code  2020_census  percent_of_total
rank
1       California         CA   39538223.0            0.1191
2            Texas         TX   29145505.0            0.0874
3          Florida         FL   21538187.0            0.0647
4              NaN         NY          NaN            0.0586
5     Pennsylvania         PA   13002700.0            0.0386

In [119]:
df=pd.read_csv('new/data.csv',names=['s','w','d','e','f'])
df.head()

      s           w           d            e                 f
0  rank       state  state_code  2020_census  percent_of_total
1     1  California          CA     39538223            0.1191
2     2       Texas          TX     29145505            0.0874
3     3     Florida          FL     21538187            0.0647
4     4         NaN          NY          NaN            0.0586

In [125]:
df=pd.read_csv('new/data.csv',nrows=25)
df.shape

(25, 5)

In [126]:
df=pd.read_csv('new/data.csv',skiprows=25)
df.shape

(26, 5)

In [134]:
df=pd.read_csv('new/data.csv',header=None)
df.head()

      0           1           2            3                 4
0  rank       state  state_code  2020_census  percent_of_total
1     1  California          CA     39538223            0.1191
2     2       Texas          TX     29145505            0.0874
3     3     Florida          FL     21538187            0.0647
4     4         NaN          NY          NaN            0.0586

# Saving Csv

In [137]:
df.to_csv('new/output.csv',index=False)